# By liulu

# -------------------------------------第十二章 Pandas库---------------------------------------------

### 当为数据添加标签、处理缺失值、分组和透视表等工作时，Numpy就显得有点力不从心。

### Pandas库是基于Numpy库的，其提供了使得数据分析变得更快更简单的高级数据结构和操作工具。

## 1.对象创建

### 1.1 Pandas series对象

带标签数据的一维数组

#### 创建对象
通用结构：pd.Series(data,index=index,dtype=dtype)

#### (1)用列表创建

In [74]:
import pandas as pd

data = pd.Series([1.5,3,4.5,6])#index缺省，则默认为整数序列
data

0    1.5
1    3.0
2    4.5
3    6.0
dtype: float64

In [75]:
data = pd.Series([1.5,3,4.5,6],index = ['a','b','c','d'])
data

a    1.5
b    3.0
c    4.5
d    6.0
dtype: float64

In [76]:
data = pd.Series([1,2,4,6],index = ['a','b','c','d'],dtype="float")
data

a    1.0
b    2.0
c    4.0
d    6.0
dtype: float64

注意：数据支持多种类型

In [77]:
data = pd.Series([1,2,"4",6],index = ['a','b','c','d'])
data

a    1
b    2
c    4
d    6
dtype: object

数据可被强制转换

In [81]:
data = pd.Series([1,2,"4",6],index = ['a','b','c','d'],dtype=float)
data

a    1.0
b    2.0
c    4.0
d    6.0
dtype: float64

#### (2) 用一维numpy数组创建

In [83]:
import numpy as np

x = np.arange(5)
pd.Series(x)

0    0
1    1
2    2
3    3
4    4
dtype: int32

#### (3)用字典创建

默认以键为index，值为data

In [84]:
population_dict = {"Beijing":2154,
                  "shanghai":2424,
                  "shenzhen":1303,
                  "hangzhou":981}
population = pd.Series(population_dict)
population

Beijing     2154
hangzhou     981
shanghai    2424
shenzhen    1303
dtype: int64

#### (4)data为标量的情况

In [86]:
pd.Series(5,index=[1,2,3])

1    5
2    5
3    5
dtype: int64

### 1.2 Pandas DataFrame对象

带标签数据的多维数组

#### 对象创建

通用结构：pd.DataFrame(data,index=index,columns=columns)

#### (1)通过Series对象创建

In [87]:
population_dict = {"Beijing":2154,
                  "shanghai":2424,
                  "shenzhen":1303,
                  "hangzhou":981}
population = pd.Series(population_dict)
pd.DataFrame(population)

             0
Beijing   2154
hangzhou   981
shanghai  2424
shenzhen  1303

In [89]:
pd.DataFrame(population,columns=["population"])

          population
Beijing         2154
hangzhou         981
shanghai        2424
shenzhen        1303

#### (2)通过Series对象字典创建

In [90]:
GDP_dict = {"Beijing":30320,
            "shanghai":32680,
            "shenzhen":24222,
            "hangzhou":13468}
GDP = pd.Series(GDP_dict)
GDP

Beijing     30320
hangzhou    13468
shanghai    32680
shenzhen    24222
dtype: int64

In [91]:
pd.DataFrame({"population":population,
             "GDP":GDP})

            GDP  population
Beijing   30320        2154
hangzhou  13468         981
shanghai  32680        2424
shenzhen  24222        1303

注意：数量不够的会自动补全

In [94]:
pd.DataFrame({"population":population,
             "GDP":GDP,
            "Country":"China"})

         Country    GDP  population
Beijing    China  30320        2154
hangzhou   China  13468         981
shanghai   China  32680        2424
shenzhen   China  24222        1303

#### (3)通过字典列表对象创建
字典索引作为index，字典键作为columns，不存在的键，会默认值为NaN

In [95]:
data = [{"a":i,"b":2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

#### (4)通过Numpy二维数组创建

In [96]:
data = np.random.randint(10,size=(3,2))
pd.DataFrame(data,index=['a','b','c'],columns=["foo","bar"])

   foo  bar
a    2    0
b    4    8
c    1    5

## 2.DataFrame性质

### 2.1 属性

In [97]:
data = pd.DataFrame({"pop":population,"GDP":GDP})
data

            GDP   pop
Beijing   30320  2154
hangzhou  13468   981
shanghai  32680  2424
shenzhen  24222  1303

#### (1)df.values返回numpy数组表示的数据

In [98]:
data.values

array([[30320,  2154],
       [13468,   981],
       [32680,  2424],
       [24222,  1303]], dtype=int64)

#### (2)df.index返回行索引

In [99]:
data.index

Index(['Beijing', 'hangzhou', 'shanghai', 'shenzhen'], dtype='object')

#### (3)df.columns返回列索引

In [100]:
data.columns

Index(['GDP', 'pop'], dtype='object')

#### (4)df.shape形状

In [101]:
data.shape

(4, 2)

#### (5) df.size大小

In [102]:
data.size

8

#### (6)df.dtypes返回每列数据类型

In [103]:
data.dtypes

GDP    int64
pop    int64
dtype: object

### 2.2 索引

In [104]:
data

            GDP   pop
Beijing   30320  2154
hangzhou  13468   981
shanghai  32680  2424
shenzhen  24222  1303

#### (1)获取列

字典式

In [105]:
data["pop"]

Beijing     2154
hangzhou     981
shanghai    2424
shenzhen    1303
Name: pop, dtype: int64

In [107]:
data[["pop","GDP"]]

           pop    GDP
Beijing   2154  30320
hangzhou   981  13468
shanghai  2424  32680
shenzhen  1303  24222

对象属性式

In [108]:
data.GDP

Beijing     30320
hangzhou    13468
shanghai    32680
shenzhen    24222
Name: GDP, dtype: int64

#### (2)获取列
绝对索引 df.loc

In [109]:
data.loc["Beijing"]

GDP    30320
pop     2154
Name: Beijing, dtype: int64

In [111]:
data.loc[["Beijing","hangzhou"]]

            GDP   pop
Beijing   30320  2154
hangzhou  13468   981

相对索引 df.iloc

In [112]:
data

            GDP   pop
Beijing   30320  2154
hangzhou  13468   981
shanghai  32680  2424
shenzhen  24222  1303

In [113]:
data.iloc[0]

GDP    30320
pop     2154
Name: Beijing, dtype: int64

In [114]:
data.iloc[[1,3]]

            GDP   pop
hangzhou  13468   981
shenzhen  24222  1303

#### (3)获取标量

In [115]:
data.loc["Beijing","GDP"]

30320

In [116]:
data.iloc[0,1]

2154

In [117]:
data.values[0,1]

2154

#### (4)Series对象的索引

In [118]:
type(data.GDP)

pandas.core.series.Series

In [119]:
GDP["Beijing"]

30320

### 2.3 切片

In [5]:
import pandas as pd
import numpy as np

In [3]:
dates = pd.date_range(start='2020-07-31',periods=6)
dates

DatetimeIndex(['2020-07-31', '2020-08-01', '2020-08-02', '2020-08-03',
               '2020-08-04', '2020-08-05'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns=["A","B","C","D"])
df

                   A         B         C         D
2020-07-31 -1.290964  0.321789 -0.741313  0.196746
2020-08-01  1.323869 -0.154872  0.375475 -1.107922
2020-08-02  0.730786  0.069872 -0.193121 -0.630426
2020-08-03  0.129936  1.176472  1.451321  0.480615
2020-08-04 -1.061032  0.581327  0.490541 -0.250966
2020-08-05  0.349620  0.274366  0.758003  0.692189

#### （1）行切片

In [7]:
df["2020-08-01":"2020-08-03"]

                   A         B         C         D
2020-08-01  1.323869 -0.154872  0.375475 -1.107922
2020-08-02  0.730786  0.069872 -0.193121 -0.630426
2020-08-03  0.129936  1.176472  1.451321  0.480615

In [8]:
df.loc["2020-08-01":"2020-08-03"]

                   A         B         C         D
2020-08-01  1.323869 -0.154872  0.375475 -1.107922
2020-08-02  0.730786  0.069872 -0.193121 -0.630426
2020-08-03  0.129936  1.176472  1.451321  0.480615

In [9]:
df.iloc[1:3]

                   A         B         C         D
2020-08-01  1.323869 -0.154872  0.375475 -1.107922
2020-08-02  0.730786  0.069872 -0.193121 -0.630426

#### （2）列切片

In [10]:
df.loc[:,"A":"C"]

                   A         B         C
2020-07-31 -1.290964  0.321789 -0.741313
2020-08-01  1.323869 -0.154872  0.375475
2020-08-02  0.730786  0.069872 -0.193121
2020-08-03  0.129936  1.176472  1.451321
2020-08-04 -1.061032  0.581327  0.490541
2020-08-05  0.349620  0.274366  0.758003

In [11]:
df.iloc[:,0:3]

                   A         B         C
2020-07-31 -1.290964  0.321789 -0.741313
2020-08-01  1.323869 -0.154872  0.375475
2020-08-02  0.730786  0.069872 -0.193121
2020-08-03  0.129936  1.176472  1.451321
2020-08-04 -1.061032  0.581327  0.490541
2020-08-05  0.349620  0.274366  0.758003

#### （3）多种多样的取值

行列同时切片

In [13]:
df.loc["2020-08-01":"2020-08-03","C":"D"]

                   C         D
2020-08-01  0.375475 -1.107922
2020-08-02 -0.193121 -0.630426
2020-08-03  1.451321  0.480615

In [14]:
df.iloc[1:3,2]

2020-08-01    0.375475
2020-08-02   -0.193121
Freq: D, Name: C, dtype: float64

行切片，列分散取值

In [15]:
df.loc["2020-08-01":"2020-08-03",["A","D"]]

                   A         D
2020-08-01  1.323869 -1.107922
2020-08-02  0.730786 -0.630426
2020-08-03  0.129936  0.480615

行分散取值，列切片  同上

行列均分散取值，相对索引df.iloc可以，绝对索引df.loc行不通

### 2.4 布尔索引

In [16]:
df

                   A         B         C         D
2020-07-31 -1.290964  0.321789 -0.741313  0.196746
2020-08-01  1.323869 -0.154872  0.375475 -1.107922
2020-08-02  0.730786  0.069872 -0.193121 -0.630426
2020-08-03  0.129936  1.176472  1.451321  0.480615
2020-08-04 -1.061032  0.581327  0.490541 -0.250966
2020-08-05  0.349620  0.274366  0.758003  0.692189

In [17]:
df > 0

                A      B      C      D
2020-07-31  False   True  False   True
2020-08-01   True  False   True  False
2020-08-02   True   True  False  False
2020-08-03   True   True   True   True
2020-08-04  False   True   True  False
2020-08-05   True   True   True   True

In [18]:
df[df>0]

                   A         B         C         D
2020-07-31       NaN  0.321789       NaN  0.196746
2020-08-01  1.323869       NaN  0.375475       NaN
2020-08-02  0.730786  0.069872       NaN       NaN
2020-08-03  0.129936  1.176472  1.451321  0.480615
2020-08-04       NaN  0.581327  0.490541       NaN
2020-08-05  0.349620  0.274366  0.758003  0.692189

In [19]:
df.A>0

2020-07-31    False
2020-08-01     True
2020-08-02     True
2020-08-03     True
2020-08-04    False
2020-08-05     True
Freq: D, Name: A, dtype: bool

In [20]:
df[df.A>0]

                   A         B         C         D
2020-08-01  1.323869 -0.154872  0.375475 -1.107922
2020-08-02  0.730786  0.069872 -0.193121 -0.630426
2020-08-03  0.129936  1.176472  1.451321  0.480615
2020-08-05  0.349620  0.274366  0.758003  0.692189

#### isin()方法

In [21]:
df2 = df.copy()
df2["E"]=[1,2,3,4,5,6]
df2

                   A         B         C         D  E
2020-07-31 -1.290964  0.321789 -0.741313  0.196746  1
2020-08-01  1.323869 -0.154872  0.375475 -1.107922  2
2020-08-02  0.730786  0.069872 -0.193121 -0.630426  3
2020-08-03  0.129936  1.176472  1.451321  0.480615  4
2020-08-04 -1.061032  0.581327  0.490541 -0.250966  5
2020-08-05  0.349620  0.274366  0.758003  0.692189  6

In [22]:
ind = df2["E"].isin([2,4])
ind

2020-07-31    False
2020-08-01     True
2020-08-02    False
2020-08-03     True
2020-08-04    False
2020-08-05    False
Freq: D, Name: E, dtype: bool

In [23]:
df2[ind]

                   A         B         C         D  E
2020-08-01  1.323869 -0.154872  0.375475 -1.107922  2
2020-08-03  0.129936  1.176472  1.451321  0.480615  4

### 2.5 赋值

#### DataFrame增加新列

In [24]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("2020-07-31",periods=6))
df["E"]=s1
df

                   A         B         C         D  E
2020-07-31 -1.290964  0.321789 -0.741313  0.196746  1
2020-08-01  1.323869 -0.154872  0.375475 -1.107922  2
2020-08-02  0.730786  0.069872 -0.193121 -0.630426  3
2020-08-03  0.129936  1.176472  1.451321  0.480615  4
2020-08-04 -1.061032  0.581327  0.490541 -0.250966  5
2020-08-05  0.349620  0.274366  0.758003  0.692189  6

#### 修改赋值

In [25]:
df.loc["2020-07-31","A"]=0
df

                   A         B         C         D  E
2020-07-31  0.000000  0.321789 -0.741313  0.196746  1
2020-08-01  1.323869 -0.154872  0.375475 -1.107922  2
2020-08-02  0.730786  0.069872 -0.193121 -0.630426  3
2020-08-03  0.129936  1.176472  1.451321  0.480615  4
2020-08-04 -1.061032  0.581327  0.490541 -0.250966  5
2020-08-05  0.349620  0.274366  0.758003  0.692189  6

In [26]:
df.iloc[0, 1]=0
df

                   A         B         C         D  E
2020-07-31  0.000000  0.000000 -0.741313  0.196746  1
2020-08-01  1.323869 -0.154872  0.375475 -1.107922  2
2020-08-02  0.730786  0.069872 -0.193121 -0.630426  3
2020-08-03  0.129936  1.176472  1.451321  0.480615  4
2020-08-04 -1.061032  0.581327  0.490541 -0.250966  5
2020-08-05  0.349620  0.274366  0.758003  0.692189  6

In [30]:
df["D"]=np.array([5]*len(df))
df

                   A         B         C  D  E
2020-07-31  0.000000  0.000000 -0.741313  5  1
2020-08-01  1.323869 -0.154872  0.375475  5  2
2020-08-02  0.730786  0.069872 -0.193121  5  3
2020-08-03  0.129936  1.176472  1.451321  5  4
2020-08-04 -1.061032  0.581327  0.490541  5  5
2020-08-05  0.349620  0.274366  0.758003  5  6

#### 修改index和columns

In [31]:
df.index = [i for i in range(len(df))]
df

          A         B         C  D  E
0  0.000000  0.000000 -0.741313  5  1
1  1.323869 -0.154872  0.375475  5  2
2  0.730786  0.069872 -0.193121  5  3
3  0.129936  1.176472  1.451321  5  4
4 -1.061032  0.581327  0.490541  5  5
5  0.349620  0.274366  0.758003  5  6

In [33]:
np.shape(df)

(6, 5)

In [39]:
df.columns = [i for i in range(df.shape[1])]
df

          0         1         2  3  4
0  0.000000  0.000000 -0.741313  5  1
1  1.323869 -0.154872  0.375475  5  2
2  0.730786  0.069872 -0.193121  5  3
3  0.129936  1.176472  1.451321  5  4
4 -1.061032  0.581327  0.490541  5  5
5  0.349620  0.274366  0.758003  5  6

## 3.数值计算及统计分析

### 3.1 数值的查看

In [1]:
import pandas as pd
import numpy as np

In [41]:
dates = pd.date_range(start='2020-07-31',periods=6)
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns=["A","B","C","D"])
df

                   A         B         C         D
2020-07-31  0.206753 -0.517626  0.470767  0.079471
2020-08-01 -0.156244 -0.024710  0.766059 -0.107290
2020-08-02  0.387838  0.321924  0.504748  0.489820
2020-08-03 -0.358035 -0.562129  0.535289  1.083783
2020-08-04 -0.615426  0.614804 -0.620354  1.739701
2020-08-05  0.177702 -0.176302  1.405684  0.382951

#### （1）查看前面的行

In [43]:
df.head()  #默认前5行

                   A         B         C         D
2020-07-31  0.206753 -0.517626  0.470767  0.079471
2020-08-01 -0.156244 -0.024710  0.766059 -0.107290
2020-08-02  0.387838  0.321924  0.504748  0.489820
2020-08-03 -0.358035 -0.562129  0.535289  1.083783
2020-08-04 -0.615426  0.614804 -0.620354  1.739701

In [44]:
df.head(2)

                   A         B         C         D
2020-07-31  0.206753 -0.517626  0.470767  0.079471
2020-08-01 -0.156244 -0.024710  0.766059 -0.107290

#### （2）查看后面的行

In [46]:
df.tail()  #默认五行

                   A         B         C         D
2020-08-01 -0.156244 -0.024710  0.766059 -0.107290
2020-08-02  0.387838  0.321924  0.504748  0.489820
2020-08-03 -0.358035 -0.562129  0.535289  1.083783
2020-08-04 -0.615426  0.614804 -0.620354  1.739701
2020-08-05  0.177702 -0.176302  1.405684  0.382951

In [47]:
df.tail(3)

                   A         B         C         D
2020-08-03 -0.358035 -0.562129  0.535289  1.083783
2020-08-04 -0.615426  0.614804 -0.620354  1.739701
2020-08-05  0.177702 -0.176302  1.405684  0.382951

#### （3）查看总体信息

In [52]:
df.iloc[0,3] = np.nan
df

                   A         B         C         D
2020-07-31  0.206753 -0.517626  0.470767       NaN
2020-08-01 -0.156244 -0.024710  0.766059 -0.107290
2020-08-02  0.387838  0.321924  0.504748  0.489820
2020-08-03 -0.358035 -0.562129  0.535289  1.083783
2020-08-04 -0.615426  0.614804 -0.620354  1.739701
2020-08-05  0.177702 -0.176302  1.405684  0.382951

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2020-07-31 to 2020-08-05
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    5 non-null float64
dtypes: float64(4)
memory usage: 400.0 bytes

### 3.2 Numpy通用函数同样适用于Pandas

#### （1）向量化运算

In [54]:
x = pd.DataFrame(np.arange(4).reshape(1,4))
x

   0  1  2  3
0  0  1  2  3

In [55]:
x + 5

   0  1  2  3
0  5  6  7  8

In [56]:
np.exp(x)

     0         1         2          3
0  1.0  2.718282  7.389056  20.085537

In [57]:
y = pd.DataFrame(np.arange(4,8).reshape(1,4))
y

   0  1  2  3
0  4  5  6  7

In [58]:
x*y

   0  1   2   3
0  0  5  12  21

#### （2）矩阵化运算

In [2]:

np.random.seed(42)
x = pd.DataFrame(np.random.randint(10,size=(30,30)))
x

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,6,3,7,4,6,9,2,6,7,4,...,4,0,9,5,8,0,9,2,6,3
1,8,2,4,2,6,4,8,6,1,3,...,2,0,3,1,7,3,1,5,5,9
2,3,5,1,9,1,9,3,7,6,8,...,6,8,7,0,7,7,2,0,7,2
3,2,0,4,9,6,9,8,6,8,7,...,0,2,4,2,0,4,9,6,6,8
4,9,9,2,6,0,3,3,4,6,6,...,9,6,8,6,0,0,8,8,3,8
5,2,6,5,7,8,4,0,2,9,7,...,2,0,4,0,7,0,0,1,1,5
6,6,4,0,0,2,1,4,9,5,6,...,5,0,8,5,2,3,3,2,9,2
7,2,3,6,3,8,0,7,6,1,7,...,3,0,1,0,4,4,6,8,8,2
8,2,2,3,7,5,7,0,7,3,0,...,1,1,5,2,8,3,0,3,0,4
9,3,7,7,6,2,0,0,2,5,6,...,4,2,3,2,0,0,4,5,2,8
10,4,7,0,4,2,0,3,4,6,0,...,5,6,1,9,1,9,0,7,0,8
11,5,6,9,6,9,2,1,8,7,9,...,6,5,2,8,9,5,9,9,5,0
12,3,9,5,5,4,0,7,4,4,6,...,0,7,2,9,6,9,4,9,4,6
13,8,4,0,9,9,0,1,5,8,7,...,5,8,4,0,3,4,9,9,4,6
14,3,0,4,6,9,9,5,4,3,1,...,6,1,0,3,7,1,2,0,0,2
15,4,2,0,0,7,9,1,2,1,2,...,6,3,9,4,1,7,3,8,4,8
16,3,9,4,8,7,2,0,2,3,1,...,8,0,0,3,8,5,2,0,3,8
17,2,8,6,3,2,9,4,4,2,8,...,6,9,4,2,6,1,8,9,9,0
18,5,6,7,9,8,1,9,1,4,4,...,3,5,2,5,6,9,9,2,6,2
19,1,9,3,7,8,6,0,2,8,0,...,4,3,2,2,3,8,1,8,0,0
20,4,5,5,2,6,8,9,7,5,7,...,3,5,0,8,0,4,3,2,5,1
21,2,4,8,1,9,7,1,4,6,7,...,0,1,8,2,0,4,6,5,0,4
22,4,5,2,4,6,4,4,4,9,9,...,1,7,6,9,9,1,5,5,2,1
23,0,5,4,8,0,6,4,4,1,2,...,8,5,0,7,6,9,2,0,4,3
24,9,7,0,9,0,3,7,4,1,5,...,3,7,8,2,2,1,9,2,2,4
25,4,1,9,5,4,5,0,4,8,9,...,9,3,0,7,0,2,3,7,5,9
26,6,7,1,9,7,2,6,2,6,1,...,0,6,5,9,8,0,3,8,3,9
27,2,8,1,3,5,1,7,7,0,2,...,8,0,4,5,4,5,5,6,3,7
28,6,8,6,2,2,7,4,3,7,5,...,1,7,9,2,4,5,9,5,3,2
29,3,0,3,0,0,9,5,4,3,2,...,1,3,0,4,8,0,8,7,5,6

In [60]:
z = x.T

In [63]:
x.dot(z)

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,876,635,701,714,690,590,602,662,541,501,...,676,598,585,444,601,701,721,630,662,603
1,635,856,640,674,581,492,539,675,548,447,...,692,396,522,419,612,689,752,668,558,584
2,701,640,1064,706,762,565,642,635,572,504,...,776,546,631,595,770,706,791,675,730,643
3,714,674,706,908,666,514,516,677,506,496,...,704,582,572,426,658,792,717,591,648,628
4,690,581,762,666,996,546,620,620,494,597,...,701,596,621,476,777,795,801,726,706,577
5,590,492,565,514,546,698,407,492,534,426,...,549,516,493,350,421,594,592,466,499,364
6,602,539,642,516,620,407,659,594,363,409,...,651,410,470,350,520,564,571,577,517,443
7,662,675,635,677,620,492,594,898,433,474,...,739,521,476,379,555,689,690,689,561,567
8,541,548,572,506,494,534,363,433,605,328,...,513,429,440,390,454,549,590,491,459,421
9,501,447,504,496,597,426,409,474,328,524,...,478,401,378,323,465,602,563,511,432,367
10,500,597,587,593,688,414,468,545,468,470,...,614,407,495,455,572,743,715,660,502,471
11,804,603,773,689,795,614,616,750,531,592,...,738,643,720,572,621,768,797,745,683,587
12,605,633,657,652,724,497,533,705,492,509,...,731,517,600,511,604,708,813,690,622,529
13,677,650,764,765,781,537,559,682,478,564,...,635,547,631,419,728,763,813,657,667,557
14,624,596,615,555,471,545,443,576,514,353,...,702,422,450,424,469,590,631,517,510,538
15,616,729,745,666,713,473,586,613,553,460,...,752,514,552,422,634,774,720,658,643,596
16,586,560,570,527,583,591,409,557,522,430,...,551,440,435,471,493,653,641,584,497,448
17,739,669,864,720,823,533,607,798,530,511,...,823,585,658,521,738,782,791,694,775,705
18,688,646,665,705,620,516,507,716,465,474,...,693,492,556,521,629,650,767,651,623,485
19,534,492,692,527,631,560,411,529,549,430,...,626,538,491,469,510,594,705,601,577,456
20,676,692,776,704,701,549,651,739,513,478,...,974,540,614,500,634,785,738,657,673,617
21,598,396,546,582,596,516,410,521,429,401,...,540,691,446,285,452,588,538,469,577,443
22,585,522,631,572,621,493,470,476,440,378,...,614,446,757,420,573,578,659,479,632,491
23,444,419,595,426,476,350,350,379,390,323,...,500,285,420,566,438,457,506,512,426,382
24,601,612,770,658,777,421,520,555,454,465,...,634,452,573,438,836,607,754,622,682,572
25,701,689,706,792,795,594,564,689,549,602,...,785,588,578,457,607,1061,712,625,609,618
26,721,752,791,717,801,592,571,690,590,563,...,738,538,659,506,754,712,1077,769,681,668
27,630,668,675,591,726,466,577,689,491,511,...,657,469,479,512,622,625,769,838,526,528
28,662,558,730,648,706,499,517,561,459,432,...,673,577,632,426,682,609,681,526,798,601
29,603,584,643,628,577,364,443,567,421,367,...,617,443,491,382,572,618,668,528,601,756

In [64]:
%timeit x.dot(z)

202 µs ± 20.8 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [65]:
%timeit np.dot(x,z)

73.1 µs ± 2 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

#### 一般来说，纯粹的计算在Numpy里执行的更快

#### （3）广播运算

In [69]:
np.random.seed(42)
x = pd.DataFrame(np.random.randint(10,size=(3,3)),columns=list("ABC"))
x

   A  B  C
0  6  3  7
1  4  6  9
2  2  6  7

In [70]:
x.iloc[0]

A    6
B    3
C    7
Name: 0, dtype: int32

In [72]:
x/x.iloc[0]  #按行广播

          A    B         C
0  1.000000  1.0  1.000000
1  0.666667  2.0  1.285714
2  0.333333  2.0  1.000000

In [73]:
x.A

0    6
1    4
2    2
Name: A, dtype: int32

In [75]:
x.div(x.A,axis=0)

     A    B         C
0  1.0  0.5  1.166667
1  1.0  1.5  2.250000
2  1.0  3.0  3.500000

### 3.3 新的用法

#### （1）索引对齐

In [80]:
df1 = pd.DataFrame(np.random.randint(10,size=(2,2)),columns=list("AB"))
df1

   A  B
0  7  5
1  1  4

In [81]:
df2 = pd.DataFrame(np.random.randint(10,size=(3,3)),columns=list("ABC"))
df2

   A  B  C
0  0  9  5
1  8  0  9
2  2  6  3

In [82]:
df1 + df2

     A     B   C
0  7.0  14.0 NaN
1  9.0   4.0 NaN
2  NaN   NaN NaN

缺省值也可以用fill_value来填充

In [83]:
df1.add(df2, fill_value=0)

     A     B    C
0  7.0  14.0  5.0
1  9.0   4.0  9.0
2  2.0   6.0  3.0

#### （2）统计相关

数据种类统计

In [84]:
y = np.random.randint(3,size=20)
y

array([0, 2, 0, 2, 2, 0, 0, 2, 1, 0, 1, 1, 1, 0, 1, 0, 1, 2, 2, 0])

In [85]:
np.unique(y)

array([0, 1, 2])

In [86]:
from collections import Counter
x = Counter(y)

Counter({0: 8, 1: 6, 2: 6})

In [89]:
y1 = pd.DataFrame(x, columns=["A"])
y1

   A
0  6
1  4
2  2

产生新的结果，并进行排序

In [90]:
population_dict = {"Beijing":2154,
                  "shanghai":2424,
                  "shenzhen":1303,
                  "hangzhou":981}
population = pd.Series(population_dict)
GDP_dict = {"Beijing":30320,
            "shanghai":32680,
            "shenzhen":24222,
            "hangzhou":13468}
GDP = pd.Series(GDP_dict)
city_info = pd.DataFrame({"population":population,"GDP":GDP})
city_info

            GDP  population
Beijing   30320        2154
hangzhou  13468         981
shanghai  32680        2424
shenzhen  24222        1303

In [91]:
city_info["per_GDP"] = city_info["GDP"]/city_info["population"]
city_info

            GDP  population    per_GDP
Beijing   30320        2154  14.076137
hangzhou  13468         981  13.728848
shanghai  32680        2424  13.481848
shenzhen  24222        1303  18.589409

递增排序

In [92]:
city_info.sort_values(by="per_GDP")

            GDP  population    per_GDP
shanghai  32680        2424  13.481848
hangzhou  13468         981  13.728848
Beijing   30320        2154  14.076137
shenzhen  24222        1303  18.589409

递减排序

In [94]:
city_info.sort_values(by="per_GDP",ascending=False)

            GDP  population    per_GDP
shenzhen  24222        1303  18.589409
Beijing   30320        2154  14.076137
hangzhou  13468         981  13.728848
shanghai  32680        2424  13.481848

按轴进行排序

In [95]:
data = pd.DataFrame(np.random.randint(10,size=(3,4)),index=[2,1,0],columns=list("CABD"))
data

   C  A  B  D
2  7  2  0  3
1  1  7  3  1
0  5  5  9  3

In [96]:
data.sort_index() #按行排序

   C  A  B  D
0  5  5  9  3
1  1  7  3  1
2  7  2  0  3

In [98]:
data.sort_index(axis=1) #按列排序

   A  B  C  D
2  2  0  7  3
1  7  3  1  1
0  5  9  5  3

#### 统计方法

In [99]:
df = pd.DataFrame(np.random.randn(6,4),columns=["A","B","C","D"])
df

          A         B         C         D
0  0.218638  0.881761 -1.009085 -1.583294
1  0.773700 -0.538142 -1.346678 -0.880591
2 -1.130552  0.134429  0.582123  0.887748
3  0.894332  0.754998 -0.207166 -0.623477
4 -1.508153  1.099647 -0.177732 -0.410383
5  1.179716 -0.898208  0.834795  0.296561

非空个数

In [100]:
df.count()

A    6
B    6
C    6
D    6
dtype: int64

求和

In [102]:
df.sum()  #默认按列求和

A    0.427682
B    1.434485
C   -1.323743
D   -2.313436
dtype: float64

In [103]:
df.sum(axis=1)

0   -1.491980
1   -1.991711
2    0.473748
3    0.818687
4   -0.996622
5    1.412865
dtype: float64

最大值最小值

In [104]:
df.min()

A   -1.508153
B   -0.898208
C   -1.346678
D   -1.583294
dtype: float64

In [105]:
df.min(axis=1)

0   -1.583294
1   -1.346678
2   -1.130552
3   -0.623477
4   -1.508153
5   -0.898208
dtype: float64

In [108]:
df.idxmax() #求最大值所在的索引

A    5
B    4
C    5
D    2
dtype: int64

均值

In [109]:
df.mean()

A    0.071280
B    0.239081
C   -0.220624
D   -0.385573
dtype: float64

方差

In [110]:
df.var()

A    1.272033
B    0.665647
C    0.730001
D    0.764690
dtype: float64

标准差

In [111]:
df.std()

A    1.127844
B    0.815872
C    0.854401
D    0.874465
dtype: float64

中位数

In [112]:
df.median()

A    0.496169
B    0.444713
C   -0.192449
D   -0.516930
dtype: float64

众数

In [113]:
df.mode()

          A         B         C         D
0 -1.508153 -0.898208 -1.346678 -1.583294
1 -1.130552 -0.538142 -1.009085 -0.880591
2  0.218638  0.134429 -0.207166 -0.623477
3  0.773700  0.754998 -0.177732 -0.410383
4  0.894332  0.881761  0.582123  0.296561
5  1.179716  1.099647  0.834795  0.887748

75%分位数

In [114]:
df.quantile(0.75)

A    0.864174
B    0.850070
C    0.392159
D    0.119825
Name: 0.75, dtype: float64

一网打尽

In [115]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.071280  0.239081 -0.220624 -0.385573
std    1.127844  0.815872  0.854401  0.874465
min   -1.508153 -0.898208 -1.346678 -1.583294
25%   -0.793255 -0.369999 -0.808605 -0.816313
50%    0.496169  0.444713 -0.192449 -0.516930
75%    0.864174  0.850070  0.392159  0.119825
max    1.179716  1.099647  0.834795  0.887748

相关性系数和协方差

In [117]:
df.corr()

          A         B         C         D
A  1.000000 -0.547862 -0.157471 -0.295062
B -0.547862  1.000000 -0.250187 -0.403150
C -0.157471 -0.250187  1.000000  0.867196
D -0.295062 -0.403150  0.867196  1.000000

自定义输出

apply(method)的用法：使用method方法默认对每一列进行相应的操作

In [119]:
df

          A         B         C         D
0  0.218638  0.881761 -1.009085 -1.583294
1  0.773700 -0.538142 -1.346678 -0.880591
2 -1.130552  0.134429  0.582123  0.887748
3  0.894332  0.754998 -0.207166 -0.623477
4 -1.508153  1.099647 -0.177732 -0.410383
5  1.179716 -0.898208  0.834795  0.296561

In [121]:
df.apply(np.cumsum)  #每一列的值都等于前面数据的累加

          A         B         C         D
0  0.218638  0.881761 -1.009085 -1.583294
1  0.992339  0.343619 -2.355763 -2.463885
2 -0.138214  0.478048 -1.773641 -1.576137
3  0.756119  1.233046 -1.980807 -2.199614
4 -0.752035  2.332693 -2.158539 -2.609998
5  0.427682  1.434485 -1.323743 -2.313436

In [122]:
df.apply(np.cumsum,axis=1)

          A         B         C         D
0  0.218638  1.100399  0.091314 -1.491980
1  0.773700  0.235559 -1.111119 -1.991711
2 -1.130552 -0.996123 -0.414001  0.473748
3  0.894332  1.649330  1.442164  0.818687
4 -1.508153 -0.408506 -0.586238 -0.996622
5  1.179716  0.281508  1.116304  1.412865

In [123]:
df.apply(lambda x: x.max()-x.min())

A    2.687870
B    1.997855
C    2.181474
D    2.471043
dtype: float64

In [124]:
def my_describe(x):
    return pd.Series([x.count(),x.mean(),x.max(),x.idxmin(),x.std()],
                    index=["Count","mean","max","idxmin","std"])
df.apply(my_describe)

               A         B         C         D
Count   6.000000  6.000000  6.000000  6.000000
mean    0.071280  0.239081 -0.220624 -0.385573
max     1.179716  1.099647  0.834795  0.887748
idxmin  4.000000  5.000000  1.000000  0.000000
std     1.127844  0.815872  0.854401  0.874465

## 4.缺失值处理

### 4.1 发现缺失值

In [125]:
import pandas as pd
import numpy as np

In [126]:
data = pd.DataFrame(np.array([[1,np.nan,2],
                             [np.nan,3,4],
                             [5,6,None]]),columns=list("ABC"))
data

     A    B     C
0    1  NaN     2
1  NaN    3     4
2    5    6  None

注意：有None、字符串等，数据类型全部变为object，它比int和float更消耗资源

In [127]:
data.dtypes

A    object
B    object
C    object
dtype: object

In [128]:
data.isnull()

       A      B      C
0  False   True  False
1   True  False  False
2  False  False   True

In [129]:
data.notnull()

       A      B      C
0   True  False   True
1  False   True   True
2   True   True  False

### 4.2 删除缺失值

In [131]:
data = pd.DataFrame(np.array([[1,np.nan,2],
                             [np.nan,3,4],
                             [5,6,np.nan]]),columns=list("ABC"))
data

     A    B    C
0  1.0  NaN  2.0
1  NaN  3.0  4.0
2  5.0  6.0  NaN

注意：np.nan 是一种特殊的浮点数

In [132]:
data.dtypes

A    float64
B    float64
C    float64
dtype: object

In [133]:
data.iloc[2,2]=4

In [134]:
data

     A    B    C
0  1.0  NaN  2.0
1  NaN  3.0  4.0
2  5.0  6.0  4.0

#### （1）删除整行

In [135]:
data.dropna()

     A    B    C
2  5.0  6.0  4.0

#### （2）删除整列

In [136]:
data.dropna(axis="columns")

     C
0  2.0
1  4.0
2  4.0

In [137]:
data["D"]=np.nan

In [138]:
data

     A    B    C   D
0  1.0  NaN  2.0 NaN
1  NaN  3.0  4.0 NaN
2  5.0  6.0  4.0 NaN

In [139]:
data.dropna(axis="columns",how="all")  #整列都是NaN时才删除

     A    B    C
0  1.0  NaN  2.0
1  NaN  3.0  4.0
2  5.0  6.0  4.0

In [140]:
data

     A    B    C   D
0  1.0  NaN  2.0 NaN
1  NaN  3.0  4.0 NaN
2  5.0  6.0  4.0 NaN

In [141]:
data.dropna(axis="columns",how="any")

     C
0  2.0
1  4.0
2  4.0

### 4.3 填充缺失值

In [142]:
data

     A    B    C   D
0  1.0  NaN  2.0 NaN
1  NaN  3.0  4.0 NaN
2  5.0  6.0  4.0 NaN

In [143]:
data.fillna(value=0)

     A    B    C    D
0  1.0  0.0  2.0  0.0
1  0.0  3.0  4.0  0.0
2  5.0  6.0  4.0  0.0

In [144]:
data

     A    B    C   D
0  1.0  NaN  2.0 NaN
1  NaN  3.0  4.0 NaN
2  5.0  6.0  4.0 NaN

用均值进行填充

In [148]:
data = data.dropna(axis="columns",how="all")

In [149]:
fill = data.mean()
fill

A    3.000000
B    4.500000
C    3.333333
dtype: float64

In [150]:
data.fillna(value=fill)

     A    B    C
0  1.0  4.5  2.0
1  3.0  3.0  4.0
2  5.0  6.0  4.0

## 5.合并数据

构造一个生产DataFrame对象的函数

In [153]:
def make_df(cols,ind):
    "一个简单的DataFrame"
    data = {c:[str(c)+str(i) for i in ind] for c in cols}
    return pd.DataFrame(data,ind)

make_df("ABC",range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

垂直合并

In [154]:
df_1 = make_df("AB",[1,2])
df_2 = make_df("AB",[3,4])
print(df_1)
print(df_2)

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4

In [155]:
pd.concat([df_1,df_2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

水平合并

In [156]:
df_3 = make_df("AB",[1,2])
df_4 = make_df("CD",[1,2])
print(df_3)
print(df_4)

    A   B
1  A1  B1
2  A2  B2
    C   D
1  C1  D1
2  C2  D2

In [157]:
pd.concat([df_3,df_4],axis=1)

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2

对齐合并

In [158]:
df_5 = make_df("AB",[1,2])
df_6 = make_df("BC",[1,2])
print(df_5)
print(df_6)

    A   B
1  A1  B1
2  A2  B2
    B   C
1  B1  C1
2  B2  C2

In [160]:
pd.merge(df_5,df_6)

    A   B   C
0  A1  B1  C1
1  A2  B2  C2

## 6.分组和数据透视表

In [162]:
df = pd.DataFrame({"key":list("ABCCBA"),
                  "data1":range(6),
                  "data2":np.random.randint(10,size=6)})
df

   data1  data2 key
0      0      0   A
1      1      2   B
2      2      4   C
3      3      2   C
4      4      0   B
5      5      4   A

### 6.1 分组

延迟计算

In [166]:
df.groupby("key")

In [164]:
df.groupby("key").sum()

     data1  data2
key
A        5      4
B        5      2
C        5      6

按列取值

In [167]:
df.groupby("key")["data2"].sum()

key
A    4
B    2
C    6
Name: data2, dtype: int32

按组迭代

In [168]:
for data,group in df.groupby("key"):
    print("{0:5} shape={1}".format(data,group.shape))

A     shape=(2, 3)
B     shape=(2, 3)
C     shape=(2, 3)

In [169]:
df.groupby("key")["data1"].describe()

     count  mean       std  min   25%  50%   75%  max
key
A      2.0   2.5  3.535534  0.0  1.25  2.5  3.75  5.0
B      2.0   2.5  2.121320  1.0  1.75  2.5  3.25  4.0
C      2.0   2.5  0.707107  2.0  2.25  2.5  2.75  3.0

In [171]:
df.groupby("key").aggregate(["min","median","max"])

    data1            data2
      min median max   min median max
key
A       0    2.5   5     0      2   4
B       1    2.5   4     0      1   2
C       2    2.5   3     2      3   4

过滤

In [174]:
def filter_func(x):
    return x["data2"].std()>1
df.groupby("key").filter(filter_func)

   data1  data2 key
0      0      0   A
1      1      2   B
2      2      4   C
3      3      2   C
4      4      0   B
5      5      4   A

将列表、数组设为分组键

In [175]:
L = [0,1,0,1,2,0]
df

   data1  data2 key
0      0      0   A
1      1      2   B
2      2      4   C
3      3      2   C
4      4      0   B
5      5      4   A

In [176]:
df.groupby(L).sum()

   data1  data2
0      7      8
1      4      4
2      4      0

### 6.2 数据透视表

## 7.其他

### 7.1多级索引

In [3]:
import pandas as pd
import numpy as np

In [7]:
base_data = np.array([[1771,11115],
                       [2154,30320],
                      [2141,14070],
                      [2424,32680],
                      [1077,7806],
                      [1303,24222],
                      [789,4789],
                      [981,13468]])
data = pd.DataFrame(base_data,index=[["Beijing","Beijing","Shanghai","Shanghai","Shenzhen","Shenzhen","Hangzhou","Hangzhou"],[2008,2018]*4],
                    columns=["population","GDP"])
data

               population    GDP
Beijing  2008        1771  11115
         2018        2154  30320
Shanghai 2008        2141  14070
         2018        2424  32680
Shenzhen 2008        1077   7806
         2018        1303  24222
Hangzhou 2008         789   4789
         2018         981  13468

In [8]:
data.index.names = ["city","year"]
data

               population    GDP
city     year
Beijing  2008        1771  11115
         2018        2154  30320
Shanghai 2008        2141  14070
         2018        2424  32680
Shenzhen 2008        1077   7806
         2018        1303  24222
Hangzhou 2008         789   4789
         2018         981  13468

In [9]:
data["GDP"]

city      year
Beijing   2008    11115
          2018    30320
Shanghai  2008    14070
          2018    32680
Shenzhen  2008     7806
          2018    24222
Hangzhou  2008     4789
          2018    13468
Name: GDP, dtype: int32

### 7.2 高性能的Pandas：eval()

In [12]:
df1,df2,df3,df4 = (pd.DataFrame(np.random.random((10000,100))) for i in range(4))
%timeit (df1+df2)/(df3+df4)

13.1 ms ± 66.4 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

减少了复合代数式计算中间过程的内存分配

In [14]:
%timeit pd.eval("(df1+df2)/(df3+df4)")

9.27 ms ± 640 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)